/*************************************************
  Copyright (C), 2007-2008, Adtech Tech. Co., Ltd.
  文件名:        Global.h
  创建人：       范志州
  创建日期：	 2007/12/21
  主要功能描述:  库文件或应用程序常用全局宏定义

  修改记录：
   1.  ...
*************************************************/
#ifndef __GLOBAL_H__
#define __GLOBAL_H__

#include	"os_cpu.h"


/********************************************************************
库调试信息打开宏，要求在所有库文件中的串口调试信息都用LIBDEBUGDISP来实现，
此时请注意每一调试输出信息必须单独占用1行,对于正常错误输出信息请用Uart_Printf
*********************************************************************/
//# define	LIBDEBUGDISP	Uart_Printf
# define	LIBDEBUGDISP	//

/********************************************************************
应用程序调试信息打开宏，在应用程序文件中的串口调试信息都用DEBUGDISP来实现，
此时请注意每一调试输出信息必须单独占用1行,对于正常错误输出信息请用Uart_Printf
*********************************************************************/
# define	DEBUGDISP	Uart_Printf
//# define	DEBUGDISP	//

#define	PRINTBMP	1 //指示是否需要打印位图
# define	DXFSURPORT	1 //定义是否支持转换DXF到链表文件，库需根据该宏定义保持两个版本

#endif