/*************************************************
  Copyright (C), 2007-2008, Adtech Tech. Co., Ltd.
  文件名:        LibFunc.h
  创建人：       范志州
  创建日期：	 2007/12/21
  主要功能描述:  库功能调用接口文件

  修改记录：
   1.  ...
*************************************************/
#ifndef __LIBFUNC_H__
#define __LIBFUNC_H__

#include	"os_cpu.h"

/*********************************************
	函数名:       	Lib_Ver
	主要功能:    	获取库版本号
	输入参数:       无
	输出参数:       无
	返回值:         库版本号,其中版本号为INT16U的整型数，例如100为1.00版以此类推
*********************************************/
INT16U	Lib_Ver(void);
/*********************************************
	函数名:       	Lib_Name
	主要功能:    	获取库名称
	输入参数:       无
	输出参数:       库的名称，当前库的名称
	返回值:         无
*********************************************/
void 	Lib_Name(INT8S *str);

/*********************************************
	函数名:       	Lib_DateTime
	主要功能:    	获取库最后更新的日期，时间
	输入参数:       无
	输出参数:       最后库更改的日期，时间
					日期格式:月 日 年 其中月为每个月英文单词的简称
					时间格式:时:分:秒
	返回值:         无
*********************************************/
void	Lib_DateTime(INT8S *date,INT8S *time);

INT16U Har_Ver1(void);
INT16U Har_Ver2(void);

#endif